class Flower:
    def __init__(cls, name: str, parks: list, viewing_period: str):
        cls.name = name
        cls.parks = parks
        cls.viewing_period = viewing_period

class FlowerViewingParks:
    _flower_viewing_parks = {
        "カントウタンポポ": Flower("カントウタンポポ", ["小山田緑地", "小山内裏公園", "浜離宮恩賜庭園", "光が丘公園"], "3月～5月"),
        "サクラソウ": Flower("サクラソウ", ["浮間公園"], "4月中旬"),
        "ツツジ・サツキ": Flower("ツツジ・サツキ", ["秋留台公園", "大泉中央公園", "旧芝離宮恩賜庭園", "旧古河庭園", "小石川後楽園", "城北中央公園", "神代植物公園", "善福寺川緑地", "戸山公園", "日比谷公園", "代々木公園", "六義園", "浜離宮恩賜庭園", "光が丘公園", "平山城址公園"], "4月中旬～5月上旬, 5月下旬～6月上旬"),
        "フジ": Flower("フジ", ["旧芝離宮恩賜庭園", "小石川後楽園", "神代植物公園", "殿ヶ谷戸庭園", "浜離宮恩賜庭園", "向島百花園"], "4月下旬〜5月上旬"),
        "ニリンソウ": Flower("ニリンソウ", ["赤塚公園", "小峰公園", "殿ヶ谷戸庭園", "石神井公園", "神代植物公園", "向島百花園"], "3月〜5月"),
        "カタクリ": Flower("カタクリ", ["小山内裏公園", "小峰公園", "神代植物公園", "殿ヶ谷戸庭園", "長沼公園"], "4月〜5月"),
        "ムラサキ": Flower("ムラサキ", ["向島百花園"], "5月下旬〜6月"),
        "バラ": Flower("バラ", ["秋留台公園", "砧公園", "旧古河庭園", "神代植物公園", "日比谷公園", "代々木公園"], "5月〜6月, 10月～11月"),
        "ハナミズキ": Flower("ハナミズキ", ["神代植物公園", "祖師谷公園", "光が丘公園", "日比谷公園", "水元公園", "代々木公園"], "4月〜5月"),
        "スイレン": Flower("スイレン", ["小石川後楽園", "神代植物公園", "善福寺公園", "舎人公園", "水元公園"], "5月下旬～7月中旬"),
        "カキツバタ": Flower("カキツバタ", ["浮間公園", "小石川後楽園", "石神井公園", "神代植物公園", "水元公園"], "5月～6月"),
        "ハナショウブ": Flower("ハナショウブ", ["清澄庭園", "旧芝離宮恩賜庭園", "旧古河庭園", "小石川後楽園", "神代植物公園", "祖師谷公園", "向島百花園", "水元公園", "浜離宮恩賜庭園"], "6月上旬～下旬"),
        "ユリ": Flower("ユリ", ["小山内裏公園", "小山田緑地", "旧岩崎邸庭園", "旧古河庭園", "小石川後楽園", "小峰公園", "桜ヶ丘公園", "殿ヶ谷戸庭園", "長沼公園", "平山城址公園", "蘆花恒春園"], "5月～6月"),
        "アジサイ": Flower("アジサイ", ["赤塚公園", "秋留台公園", "浮間公園", "大泉中央公園", "旧岩崎邸庭園", "旧芝離宮恩賜庭園", "清澄庭園", "小峰公園", "桜ヶ丘公園", "篠崎公園", "石神井公園", "神代植物公園", "善福寺公園", "殿ヶ谷戸庭園", "八丈植物公園", "浜離宮恩賜庭園", "光が丘公園", "日比谷公園", "向島百花園", "代々木公園", "六義園"], "6月～8月"),
        "オニバス": Flower("オニバス", ["水元公園"], "7月"),
        "ハス": Flower("ハス", ["小石川後楽園", "神代植物公園", "水元公園"], "7月中旬～8月中旬"),
        "ハギ": Flower("ハギ", ["旧芝離宮恩賜庭園", "神代植物公園", "殿ヶ谷戸庭園", "浜離宮恩賜庭園", "向島百花園"], "8月～9月"),
        "キバナコスモス": Flower("キバナコスモス", ["浜離宮恩賜庭園"], "7月～9月"),
        "コスモス": Flower("コスモス", ["秋留台公園", "小金井公園", "浜離宮恩賜庭園"], "9月～10月"),
        "紅葉": Flower("紅葉", ["清澄庭園", "殿ヶ谷戸庭園", "水元公園", "六義園", "光が丘公園", "小石川後楽園", "浜離宮恩賜庭園"], "11月～12月"),
        "冬桜（ふゆざくら）": Flower("冬桜（ふゆざくら）", ["神代植物公園"], "10月～4月"),
        "十月桜（じゅうがつざくら）": Flower("十月桜（じゅうがつざくら）", ["祖師谷公園", "浜離宮恩賜庭園"], "10月～12月, 4月"),
        "ヒガンバナ": Flower("ヒガンバナ", ["小山田緑地", "葛西臨海公園", "小石川後楽園", "神代植物公園", "浜離宮恩賜庭園", "向島百花園"], "9月"),
        "パンパスグラス": Flower("パンパスグラス", ["神代植物公園", "水元公園"], "9月～10月"),
        "ススキ": Flower("ススキ", ["小山田緑地", "小峰公園", "浜離宮恩賜庭園", "光が丘公園", "向島百花園"], "9月～10月"),
        "秋の七草": Flower("秋の七草", ["神代植物公園", "殿ヶ谷戸庭園", "向島百花園"], "6月～11月"),
        "雪吊り": Flower("雪吊り", ["旧芝離宮恩賜庭園", "旧古河庭園", "清澄庭園", "小石川後楽園", "神代植物公園", "殿ヶ谷戸庭園", "浜離宮恩賜庭園", "向島百花園", "六義園"], "12月～3月"),
        "春の七草": Flower("春の七草", ["向島百花園", "小山内裏公園"], "お正月明け～1月上旬"),
        "ウメ": Flower("ウメ", ["赤塚公園", "浮間公園", "大泉中央公園", "葛西臨海公園", "砧公園", "木場公園", "旧芝離宮恩賜庭園", "旧古河庭園", "清澄庭園", "小石川後楽園", "小金井公園", "小峰公園", "芝公園", "神代植物公園", "善福寺公園", "殿ヶ谷戸庭園", "戸山公園", "浜離宮恩賜庭園", "光が丘公園", "向島百花園", "代々木公園", "蘆花恒春園", "六義園"], "1月～3月"),
        "フクジュソウ": Flower("フクジュソウ", ["旧岩崎邸庭園", "清澄庭園", "殿ヶ谷戸庭園", "林試の森公園"], "2月"),
        "スイセン": Flower("スイセン", ["葛西臨海公園", "旧古河庭園", "旧芝離宮恩賜庭園", "浜離宮恩賜庭園", "日比谷公園"], "1月～4月"),
        "ナノハナ": Flower("ナノハナ", ["浜離宮恩賜庭園"], "2月～3月"),
        "ツバキ": Flower("ツバキ", ["赤塚公園", "浮間公園", "大泉中央公園", "木場公園", "旧芝離宮恩賜庭園", "小石川後楽園", "小峰公園", "神代植物公園", "善福寺公園", "善福寺川緑地", "殿ヶ谷戸庭園", "戸山公園", "浜離宮恩賜庭園", "日比谷公園", "向島百花園", "代々木公園", "六義園", "林試の森公園"], "1月～4月"),
    }

    @classmethod
    def get_parks_from_flower(cls, flower_name: str) -> list:
        """指定された花が見られる公園のリストを返す

        Args:
            flower_name (str): 花の名前

        Returns:
            list: 公園名のリスト。穴が見つからない場合は空のリストを返す。
        """
        flower = cls._flower_viewing_parks.get(flower_name)
        return flower.parks if flower else []

    @classmethod
    def get_term_from_flower(cls, flower_name: str) -> str:
        """指定された花の鑑賞期間を返す。

        Args:
            flower_name (str): 花の名前

        Returns:
            str: 指定された花の鑑賞期間。見つからなかった場合、空文字列を返す。
        """
        flower = cls._flower_viewing_parks.get(flower_name)
        return flower.viewing_period if flower else ""

    @classmethod
    def get_flower_list(cls) -> list:
        """登録されている全ての花のリストを返す。

        Returns:
            list: 登録されている花のリスト。
        """
        return list(cls._flower_viewing_parks.keys())

    @classmethod
    def get_park_list(cls) -> list:
        """登録されている全ての公園のリストを返す。

        Returns:
            list: 登録されている全ての公園のリスト。
        """
        parks_set = set(park for _, flower in cls._flower_viewing_parks.items() for park in flower.parks)
        return list(parks_set)